# Aula 01 - Resolução dos Exercícios

## Novas perguntas do CEO

1. Quantas casas estão disponíveis para compra?
2. Quantos atributos as casas possuem?
3. Quais são os atributos da casa?
4. Qual a casa mais cara (casa com maior valor de venda)?
5. Qual a casa com o maior número de quartos?
6. Qual a soma total de quartos no dataset?
7. Quantas casas possuem 2 banheiros?
8. Qual o preço médio de todas as casas no dataset?
9. Qual o preço médio das casas com 2 banheiros?
10. Qual o preço mínimo entre as casas com 3 quartos?
11. Quantas casas possuem mais de 300 m² na sala de estar?
12. Quantas casas possuem 2 andares?
13. Quantas casas tem vista para o mar?
14. Das casas com vista para o mar, quantas tem 3 quartos?
15. Das casas com mais de 300 m² de sala de estar, quantas tem mais de 2 banheiros?

## 0. Loading Data

In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('kc_house_data.csv', low_memory=False, delimiter=',', quotechar='"')

## 1. Quantas casas estão disponíveis para compra?

In [6]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [7]:
len(df['id'].unique())

21436

## 2. Quantos atributos as casas possuem?

In [8]:
len(df.drop(columns=['date', 'id']))

21613

## 3. Quais são os atributos da casa?

In [11]:
print(df.columns.to_list())

['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade', 'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode', 'lat', 'long', 'sqft_living15', 'sqft_lot15']

In [12]:
print(len(df.columns.to_list()))

21

## 4. Qual a casa mais cara (casa com maior valor de venda)?

In [16]:
df[['id', 'price']].sort_values('price', ascending=False).reset_index(drop=True).loc[0, 'id']

6762700020

In [17]:
df[['id', 'price']].sort_values('price', ascending=False).head()

              id      price
7252  6762700020  7700000.0
3914  9808700762  7062500.0
9254  9208900037  6885000.0
4411  2470100110  5570000.0
1448  8907500070  5350000.0

## 5. Qual a casa com o maior número de quartos?

In [18]:
df[['id', 'bedrooms']].sort_values('bedrooms', ascending=False).reset_index(drop=True).loc[0, 'id']

2402100895

In [19]:
df[['id', 'bedrooms']].sort_values('bedrooms', ascending=False).head()

               id  bedrooms
15870  2402100895        33
8757   1773100755        11
15161  5566100170        10
13314   627300145        10
19254  8812401450        10

## 6. Qual a soma total de quartos no dataset?

In [20]:
df['bedrooms'].sum()

72854

## 7. Quantas casas possuem 2 banheiros?

In [26]:
len(df.loc[df['bedrooms'] > 2, ['id', 'bedrooms']])

18641

## 8. Qual o preço médio de todas as casas no dataset?

In [25]:
round(df['price'].mean(), 2)

540088.14

## 9. Qual o preço médio das casas com 2 banheiros?

In [29]:
round(df.loc[df['bathrooms'] == 2, 'price'].mean(), 2)

457889.72

## 10. Qual o preço mínimo entre as casas com 3 quartos?

In [31]:
round(df.loc[df['bedrooms'] == 3, 'price'].min(), 2)

82000.0

## 11. Quantas casas possuem mais de 300 m² na sala de estar?

In [32]:
df['m2'] = df['sqft_living'] * 0.093
len(df.loc[df['m2'] > 300])

2258

## 12. Quantas casas possuem 2 andares?

In [33]:
len(df.loc[df['floors'] == 2])

8241

## 13. Quantas casas tem vista para o mar?

In [34]:
len(df.loc[df['waterfront'] == 1])

163

## 14. Das casas com vista para o mar, quantas tem 3 quartos?

In [38]:
len(df.loc[(df['waterfront'] == 1) & (df['bedrooms'] == 3)])

64

## 15. Das casas com mais de 300 m² de sala de estar, quantas tem mais de 2 banheiros?

In [39]:
len(df.loc[(df['m2'] > 300) & (df['bathrooms'] > 2)])

2201